---
kind: property
id: P:Autodesk.Revit.DB.NurbsSurfaceData.DegreeU
source: html/fc2de49b-75ef-b407-cecf-3dd0199b775a.htm
---
# Autodesk.Revit.DB.NurbsSurfaceData.DegreeU Property

The degree of the spline in the u-direction.

## Syntax (C#)
```csharp
public int DegreeU { get; }
```